README.md
```mermaid
erDiagram
    AUTH_USER {
        integer id PK
        varchar password
        datetime last_login
        boolean is_superuser
        varchar username
        varchar first_name
        varchar last_name
        varchar email
        boolean is_staff
        boolean is_active
        datetime date_joined
    }

    DETECTION_POST {
        integer id PK
        varchar subject
        text content
        datetime create_date
        datetime modify_date
        integer view_count
        varchar image1
        integer author_id FK
    }

    DETECTION_COMMENT {
        integer id PK
        text content
        datetime create_date
        datetime modify_date
        varchar image1
        integer author_id FK
        integer post_id FK
    }

    DETECTION_POST_VOTER {
        integer id PK
        integer detectionpost_id FK
        integer user_id FK
    }

    DETECTION_COMMENT_VOTER {
        integer id PK
        integer detectioncomment_id FK
        integer user_id FK
    }

    SIMILARITY_POST {
        integer id PK
        varchar subject
        text content
        datetime create_date
        datetime modify_date
        integer view_count
        varchar image1
        varchar image2
        integer author_id FK
    }

    SIMILARITY_COMMENT {
        integer id PK
        text content
        datetime create_date
        datetime modify_date
        varchar image1
        varchar image2
        integer author_id FK
        integer post_id FK
    }

    SIMILARITY_POST_VOTER {
        integer id PK
        integer similaritypost_id FK
        integer user_id FK
    }

    SIMILARITY_COMMENT_VOTER {
        integer id PK
        integer similaritycomment_id FK
        integer user_id FK
    }

    AUTH_USER ||--o{ DETECTION_POST : write
    AUTH_USER ||--o{ DETECTION_COMMENT : write
    AUTH_USER ||--o{ SIMILARITY_POST : write
    AUTH_USER ||--o{ SIMILARITY_COMMENT : write
    DETECTION_POST ||--o{ DETECTION_COMMENT : comment
    DETECTION_POST ||--o{ DETECTION_POST_VOTER : recommend
    DETECTION_COMMENT ||--o{ DETECTION_COMMENT_VOTER : recommend
    SIMILARITY_POST ||--o{ SIMILARITY_COMMENT : comment
    SIMILARITY_POST ||--o{ SIMILARITY_POST_VOTER : recommend
    SIMILARITY_COMMENT ||--o{ SIMILARITY_COMMENT_VOTER : recommend
```
